[
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "Let's collaborate to conserve resources for mutual gain, aiming for sustainable use throughout all rounds. What are your thoughts on balancing this?",
    "timestamp": "2025-05-14T12:36:26.504789"
  },
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "We should aim for sustainable use while securing gains. How can we ensure both aspects benefit us this round?",
    "timestamp": "2025-05-14T12:36:27.674316"
  },
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "Let's aim for a fair balance, conserving resources while optimizing gains for both of us this round. How does that sound to you?",
    "timestamp": "2025-05-14T12:36:28.895321"
  },
  {
    "round": 0,
    "sender_id": "V1",
    "recipient_id": "D1",
    "message": "Let's conserve 50 units this round to ensure long-term gain. Agree on mutual benefit and adapt each round for success.",
    "timestamp": "2025-05-14T12:36:31.273096"
  },
  {
    "round": 0,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "Let's use 40 units now and conserve 40 for future rounds. Balancing resources will maximize mutual long-term benefits.",
    "timestamp": "2025-05-14T12:36:32.684072"
  },
  {
    "round": 0,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "Let's use 35 units and conserve 45 for future rounds. Balancing use now can enhance our mutual long-term benefits.",
    "timestamp": "2025-05-14T12:36:33.876125"
  },
  {
    "round": 0,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "Let's cooperatively manage 30 units each this round for balanced growth and sustainability. Thoughts?",
    "timestamp": "2025-05-14T12:36:35.211471"
  },
  {
    "round": 0,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "Let's allocate 25 units each for sustainable growth, ensuring mutual benefit while conserving resources for future rounds. What do you think?",
    "timestamp": "2025-05-14T12:36:36.536231"
  },
  {
    "round": 0,
    "sender_id": "E1",
    "recipient_id": "C1",
    "message": "Let's mutually use 20 units each this round, balancing resource conservation and personal gain for better outcomes in future rounds.",
    "timestamp": "2025-05-14T12:36:37.927382"
  },
  {
    "round": 0,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "Let's use 30 units now and conserve 40 for future rounds. This balances our immediate needs with long-term sustainability. Thoughts?",
    "timestamp": "2025-05-14T12:36:40.928269"
  },
  {
    "round": 0,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "Let's aim to use 25 units this round and save 45 for future rounds to maximize mutual gains and sustainability. Thoughts?",
    "timestamp": "2025-05-14T12:36:42.476390"
  },
  {
    "round": 0,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "Let's use 28 units now and save 42 for the future. This ensures our needs are met while conserving resources. What do you think?",
    "timestamp": "2025-05-14T12:36:43.723555"
  },
  {
    "round": 0,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's each use 25 units this round to save 20 for future rounds. Balance is key for long-term mutual success.\"",
    "timestamp": "2025-05-14T12:36:45.037578"
  },
  {
    "round": 0,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's each use 30 units to secure current benefit while saving 40 for future gains. It’s a balanced path to mutual success.\"",
    "timestamp": "2025-05-14T12:36:46.145588"
  },
  {
    "round": 0,
    "sender_id": "C1",
    "recipient_id": "E1",
    "message": "\"Let's each use 25 units to ensure personal gain while preserving 20 units for future success. Balanced use ensures mutual long-term benefits.\"",
    "timestamp": "2025-05-14T12:36:47.396307"
  },
  {
    "round": 0,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "Let's both aim to use 20 units this round, conserving resources for mutual long-term gain. Sound good to you?",
    "timestamp": "2025-05-14T12:36:48.570977"
  },
  {
    "round": 0,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "Let's both use 20 units this round, securing our resources and ensuring mutual benefits for future rounds. What do you think?",
    "timestamp": "2025-05-14T12:36:49.848985"
  },
  {
    "round": 0,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "Let's both use 20 units this round to balance our gains while conserving resources for future success. Agree?",
    "timestamp": "2025-05-14T12:36:50.810448"
  },
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "Let's use 15 units each to preserve resources. This ensures fair usage and strengthens our strategy for future rounds. Sound good to you?",
    "timestamp": "2025-05-14T12:36:52.088365"
  },
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "Let's use 10 units each, ensuring resource conservation and boosting our long-term success. Cooperation now secures more benefits later.",
    "timestamp": "2025-05-14T12:36:53.231229"
  },
  {
    "round": 0,
    "sender_id": "J1",
    "recipient_id": "C1",
    "message": "Let's both use 12 units, balancing resource conservation and personal gain for sustainable success in this simulation.",
    "timestamp": "2025-05-14T12:36:54.371079"
  },
  {
    "round": 1,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Let's use 25 units each; this balances immediate needs and conserves 27 for future growth. It's fair and sustainable for both of us.\"",
    "timestamp": "2025-05-14T12:37:07.671790"
  },
  {
    "round": 1,
    "sender_id": "V1",
    "recipient_id": "D1",
    "message": "\"Let's use 22 units each this round to balance current needs and save 33 for sustained future success. Fair for both of us?\"",
    "timestamp": "2025-05-14T12:37:10.837002"
  },
  {
    "round": 1,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's use 27 units each—ensures present gain while saving 23 for future rounds. It's a balanced approach for mutual success. Thoughts?\"",
    "timestamp": "2025-05-14T12:37:12.166991"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "C1",
    "message": "\"Let's each use 22 units. It keeps us sustainable for future rounds while securing fair gains now. How does that sound to you?\"",
    "timestamp": "2025-05-14T12:37:13.617820"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's each use 24 units. Ensures fair use now while still conserving plenty for later. Your thoughts?\"",
    "timestamp": "2025-05-14T12:37:15.037376"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "V1",
    "message": "\"Let's each use 23 units. This approach balances short-term benefits with conserving resources for future rounds, ensuring mutual success.\"",
    "timestamp": "2025-05-14T12:37:16.020095"
  },
  {
    "round": 1,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Let's allocate 20 units each, saving 37 for future use. This balances our needs and ensures sustainable growth. How does that sound to you?\"",
    "timestamp": "2025-05-14T12:37:17.557711"
  },
  {
    "round": 1,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "\"Let's use 18 units each, conserving 41 for future rounds. This supports our shared goals and ensures strategic resource management long-term. Agree?\"",
    "timestamp": "2025-05-14T12:37:18.756807"
  },
  {
    "round": 1,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Let's use 20 units each, saving 37. This balances current needs while conserving for future rounds. How does this strategy align with your goals?\"",
    "timestamp": "2025-05-14T12:37:20.264758"
  },
  {
    "round": 1,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each use 20 units. This maintains a fair balance, conserving resources while ensuring we both benefit in the long term.\"",
    "timestamp": "2025-05-14T12:37:21.788699"
  },
  {
    "round": 1,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "\"Let's use 18 units each, conserving resources while ensuring personal and mutual long-term gains. How does this approach align with your strategy?\"",
    "timestamp": "2025-05-14T12:37:23.130478"
  },
  {
    "round": 1,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Let's use 22 units each to balance immediate benefits with sustainable resource conservation, ensuring we both succeed in the longer run. Thoughts?\"",
    "timestamp": "2025-05-14T12:37:24.110615"
  },
  {
    "round": 1,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's use 20 units each, saving 37 for future rounds. This ensures our immediate needs are met while conserving for long-term success.\"",
    "timestamp": "2025-05-14T12:37:25.770514"
  },
  {
    "round": 1,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "\"Let's use 18 each to meet needs now and save 41 for future needs. This balances personal gain and resource sustainability.\"",
    "timestamp": "2025-05-14T12:37:27.191529"
  },
  {
    "round": 1,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Let's use 22 units each, saving 33. This balances immediate needs while preserving resources for future rounds. A fair approach for both of us.\"",
    "timestamp": "2025-05-14T12:37:28.318439"
  },
  {
    "round": 1,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "Let's use 25 units each, conserving resources while securing fair gains now for sustainable future rounds. How does that sound to you?",
    "timestamp": "2025-05-14T12:37:31.630800"
  },
  {
    "round": 1,
    "sender_id": "C1",
    "recipient_id": "D1",
    "message": "Let's each use 20 units this round to balance resource conservation and personal gain, ensuring a sustainable strategy for future success.",
    "timestamp": "2025-05-14T12:37:32.899387"
  },
  {
    "round": 1,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "Let's each use 24 units to ensure we balance resource conservation and personal gain, aiming for sustainable success in future rounds.",
    "timestamp": "2025-05-14T12:37:34.024682"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Using 19 units each secures 33 for future rounds, balancing immediate gain with long-term resource stability. Agree to prioritize sustainability?\"",
    "timestamp": "2025-05-14T12:37:42.150781"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's each use 21 units and keep 31 for future. Balances our gains now and preserves resources for later rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:37:43.781650"
  },
  {
    "round": 1,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "\"Let’s use 19 units each, saving 33. Balances gains now and ensures resources for future rounds. Cooperative approach for mutual benefit. Agree?\"",
    "timestamp": "2025-05-14T12:37:45.551848"
  },
  {
    "round": 2,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "\"Let's each use 21 units. This conserves resources while ensuring mutual benefits and a strong position for future rounds.\"",
    "timestamp": "2025-05-14T12:37:50.671624"
  },
  {
    "round": 2,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "\"Let's each use 21 units. This enables us to balance immediate gains with preserving resources, ensuring both our long-term success.\"",
    "timestamp": "2025-05-14T12:37:51.864335"
  },
  {
    "round": 2,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's each use 21 units to balance immediate needs and conserve resources, ensuring we're set up for future success together.\"",
    "timestamp": "2025-05-14T12:37:53.138875"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's each use 20 units, keeping 22 for future rounds. Balancing our needs today ensures better mutual gains tomorrow. Thoughts on this approach?\"",
    "timestamp": "2025-05-14T12:37:55.440475"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "\"Let's use 19 units each, leaving 24 for the future. This balances immediate gains while conserving resources for mutual long-term benefits. Thoughts?\"",
    "timestamp": "2025-05-14T12:37:56.560039"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Let's use 20 units each, saving 22 units. This balances current usage with future conservation for mutual benefit. Thoughts?\"",
    "timestamp": "2025-05-14T12:37:57.739474"
  },
  {
    "round": 2,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's each use 18 units. It balances resource conservation with fair gains, keeping the pool strong for future rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:38:01.081439"
  },
  {
    "round": 2,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's each use 19 units. It ensures fair gains now while conserving resources for future rounds. Your thoughts?\"",
    "timestamp": "2025-05-14T12:38:01.967860"
  },
  {
    "round": 2,
    "sender_id": "C1",
    "recipient_id": "E1",
    "message": "\"How about we each use 19 units? It balances sustainable gains and resource conservation for successful future rounds. Your thoughts?\"",
    "timestamp": "2025-05-14T12:38:03.003697"
  },
  {
    "round": 2,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's each use 19 units this round, conserving 38. Balances individual gain and future security. Are you on board with this balanced approach?\"",
    "timestamp": "2025-05-14T12:38:04.220686"
  },
  {
    "round": 2,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Propose we use 19 units each, saving 38. Balances immediate need and future security, aligning shared interests with sustainable strategy. Thoughts?\"",
    "timestamp": "2025-05-14T12:38:05.599256"
  },
  {
    "round": 2,
    "sender_id": "J1",
    "recipient_id": "C1",
    "message": "\"Let's use 19 units each, preserving 38. Balances immediate needs and future gains, aligning mutual goals with sustainable strategy. Agree?\"",
    "timestamp": "2025-05-14T12:38:06.676816"
  },
  {
    "round": 2,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Let's each use 19 units. It aligns with our goal for ethical resource use while ensuring fair gains this round and conserving for the future.\"",
    "timestamp": "2025-05-14T12:38:07.982384"
  },
  {
    "round": 2,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "\"Let's use 19 units each, balancing personal gains and resource sustainability for long-term mutual success. What do you think?\"",
    "timestamp": "2025-05-14T12:38:08.917693"
  },
  {
    "round": 2,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each use 19 units, prioritizing both our gains and sustainable resource use for future benefits. Does this strategy work for you?\"",
    "timestamp": "2025-05-14T12:38:09.964379"
  },
  {
    "round": 2,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "\"Let's aim for 18 each, preserving 21. This ensures personal gain while safeguarding resources for future rounds. Thoughts on this balanced approach?\"",
    "timestamp": "2025-05-14T12:38:11.533817"
  },
  {
    "round": 2,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Let's use 18 each, leaving 21 for future rounds. Balances immediate needs and resource sustainability for mutual benefit. Agree with this approach?\"",
    "timestamp": "2025-05-14T12:38:12.993459"
  },
  {
    "round": 2,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Suggest we use 18 each, saving 21 units. Balances personal gain and resource sustainability for future rounds. Agree with this strategy?\"",
    "timestamp": "2025-05-14T12:38:14.228982"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's use 18 units each, conserving 9. Balances immediate use with sustainability, ensuring mutual long-term benefit. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:38:26.500135"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "C1",
    "message": "\"Let's use 18 units each. It balances personal gain and resource conservation, ensuring mutual success long-term. Does this fit with your plans?\"",
    "timestamp": "2025-05-14T12:38:27.746703"
  },
  {
    "round": 2,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Suggest 18 units each, conserving 9. Balances our immediate needs and future sustainability. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:38:28.990651"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "D1",
    "message": "\"How about using 18 units each? It ensures both personal gain and future sustainability. Does this approach align with your strategy?\"",
    "timestamp": "2025-05-14T12:38:32.868260"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "\"Let's use 17 units each, securing gains and conserving resources for the future. Does this strategy work for you?\"",
    "timestamp": "2025-05-14T12:38:33.861943"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's use 17 units each, balancing personal gain with resource conservation for long-term success. Does this work for you?\"",
    "timestamp": "2025-05-14T12:38:34.869758"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "V1",
    "message": "\"How about we each use 18 units? It balances personal gain with conservation, ensuring sustainability and mutual success in future rounds.\"",
    "timestamp": "2025-05-14T12:38:36.450403"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "\"Let's use 17 units each. It balances fair gain now with conservation for future rounds, supporting our mutual long-term success.\"",
    "timestamp": "2025-05-14T12:38:37.706979"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Let's each use 17 units. This balances fair gain with resource conservation, supporting our mutual long-term success and ensuring future stability.\"",
    "timestamp": "2025-05-14T12:38:39.908699"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "\"Let's use 20 units each this round to ensure fair gains and resource conservation for future rounds. What do you think?\"",
    "timestamp": "2025-05-14T12:38:41.253076"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "C1",
    "message": "\"Let's each use 21 units, balancing immediate gains and conserving 21 for future rounds. Ensures mutual long-term success. Agree?\"",
    "timestamp": "2025-05-14T12:38:42.729980"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each use 20 units for balanced gains. This preserves 2 units for future rounds, aligning immediate reward with long-term sustainability. Your thoughts?\"",
    "timestamp": "2025-05-14T12:38:43.822841"
  },
  {
    "round": 3,
    "sender_id": "C1",
    "recipient_id": "E1",
    "message": "\"Let's use 17 units each, conserving 37. Balances immediate gain while supporting long-term sustainability. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:38:51.202269"
  },
  {
    "round": 3,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's use 18 units each, keeping 36. Ensures personal gains while fostering shared long-term success. Does this strategy work for you?\"",
    "timestamp": "2025-05-14T12:38:52.232150"
  },
  {
    "round": 3,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's use 16 units each, keeping 41. Balances individual gain and resource sustainability for future rounds. Does this strategy suit our shared goals?\"",
    "timestamp": "2025-05-14T12:38:53.849782"
  },
  {
    "round": 3,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "\"Let's use 18 units each. This balances immediate gains and conserves resources for future rounds, supporting our long-term interests. Your thoughts?\"",
    "timestamp": "2025-05-14T12:38:57.000613"
  },
  {
    "round": 3,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Let's use 18 units each for balanced gains and future sustainability. It supports our mutual long-term goals. Thoughts?\"",
    "timestamp": "2025-05-14T12:38:58.232128"
  },
  {
    "round": 3,
    "sender_id": "D1",
    "recipient_id": "U1",
    "message": "\"Let's use 18 units each, balancing immediate gains with future resource sustainability to support our long-term mutual goals. Thoughts?\"",
    "timestamp": "2025-05-14T12:38:59.861536"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Let's each use 17 units, conserving 34. Balances our gains now with a sustainable approach for future rounds. Agree with this strategy?\"",
    "timestamp": "2025-05-14T12:39:01.180987"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "\"Let's use 16 units each, conserving 32 for sustainability while ensuring our gains. Balances immediate benefit with future resource wealth. Agree with this approach?\"",
    "timestamp": "2025-05-14T12:39:02.574196"
  },
  {
    "round": 3,
    "sender_id": "U1",
    "recipient_id": "C1",
    "message": "\"Let's each use 17 units, conserving 34. This balances our current gains with future sustainability. Does this strategic approach work for you?\"",
    "timestamp": "2025-05-14T12:39:03.792505"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "\"Let's use 17 units each, keeping 26. Balances personal gain and conservation. How does this fit with your long-term goals and strategy?\"",
    "timestamp": "2025-05-14T12:39:05.311167"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"How about 17 units each? This preserves 10, balancing our needs and sustainability. Aligns with ensuring long-term mutual success. What do you think?\"",
    "timestamp": "2025-05-14T12:39:06.655070"
  },
  {
    "round": 3,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Suggest 17 each, conserving 22 units. Balances immediate needs with future sustainability, aligning with our shared strategy. Does this strategy work for you?\"",
    "timestamp": "2025-05-14T12:39:08.279473"
  },
  {
    "round": 3,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "\"Propose using 17 each for balanced resource use and personal gain. Ensures fair growth and preserves enough for future rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:11.840597"
  },
  {
    "round": 3,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's mutually aim for 17 units each. Balances personal gain with resource sustainability for shared long-term success. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:12.942544"
  },
  {
    "round": 3,
    "sender_id": "E1",
    "recipient_id": "C1",
    "message": "\"Let's use 17 units each, balancing personal gain with resource sustainability. Supports our shared long-term strategy. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:13.839305"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Let's aim for 16 units each, ensuring sustainable use and mutual benefit while leaving room for resource regeneration. Agree?\"",
    "timestamp": "2025-05-14T12:39:17.366538"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "V1",
    "message": "\"Let's use 16 units each. This balances personal gain and sustainability, preserving resources for future rounds. How does this approach sound to you?\"",
    "timestamp": "2025-05-14T12:39:18.568583"
  },
  {
    "round": 3,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "\"Let's go for 16 units each, balancing immediate benefits with long-term resource conservation. This ensures sustainable growth for both of us. What do you think?\"",
    "timestamp": "2025-05-14T12:39:19.635976"
  },
  {
    "round": 4,
    "sender_id": "C1",
    "recipient_id": "E1",
    "message": "\"Let's use 15 units each, conserving 5. This ensures our gains now while saving resources for future rounds. How does this strategy sound to you?\"",
    "timestamp": "2025-05-14T12:39:31.368585"
  },
  {
    "round": 4,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's use 16 units each, ensuring mutual gain while keeping 3 units for future sustainability. Does this plan complement your long-term goals?\"",
    "timestamp": "2025-05-14T12:39:32.482615"
  },
  {
    "round": 4,
    "sender_id": "C1",
    "recipient_id": "D1",
    "message": "\"Proposing we use 16 units each, leaving 3 for future strategy. Balances immediate benefit with long-term conservation. Does this align with your goals?\"",
    "timestamp": "2025-05-14T12:39:33.564648"
  },
  {
    "round": 4,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Let’s use 15 units each, saving 5. This balances gain and sustainability, supporting our shared goals for this and future rounds.\"",
    "timestamp": "2025-05-14T12:39:35.739529"
  },
  {
    "round": 4,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's each use 17 units, preserving 1 for future rounds. This balances immediate gain with resource sustainability, optimizing our chances for long-term success.\"",
    "timestamp": "2025-05-14T12:39:36.866778"
  },
  {
    "round": 4,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "\"Let's each use 18 units, leaving 1 for future rounds. This ensures balanced gains and sustainability for our mutual long-term success.\"",
    "timestamp": "2025-05-14T12:39:38.033961"
  },
  {
    "round": 4,
    "sender_id": "D1",
    "recipient_id": "U1",
    "message": "\"Let's use 18 units each this round. Balances our short-term needs with conserving resources for future rounds. Agree with this approach?\"",
    "timestamp": "2025-05-14T12:39:39.647614"
  },
  {
    "round": 4,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Suggest using 17 units each for balanced current gain and future sustainability. This approach supports our mutual long-term success. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:40.794240"
  },
  {
    "round": 4,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "\"Suggest using 16 units each. Balances immediate gain with conserving resources for future rounds, ensuring mutual long-term success. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:39:42.343490"
  },
  {
    "round": 4,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "\"Let's aim for 17 units each. Ensures fair use while conserving 1 unit for sustainability. Supports both our gains and future rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:43.925108"
  },
  {
    "round": 4,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's use 17 units each, leaving 1 unit. Balances immediate gain with shared sustainability. Supports both our long-term success and ethical management.\"",
    "timestamp": "2025-05-14T12:39:45.172805"
  },
  {
    "round": 4,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "\"Let's use 17 units each. Balances personal gain with conserving 1 unit. Supports long-term success and ethical resource management. Thoughts?\"",
    "timestamp": "2025-05-14T12:39:46.590222"
  },
  {
    "round": 4,
    "sender_id": "E1",
    "recipient_id": "U1",
    "message": "\"Let's use 16 units each, allowing us to conserve 3 for future rounds while maximizing our current gain. Agree?\"",
    "timestamp": "2025-05-14T12:39:47.944074"
  },
  {
    "round": 4,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "\"Let's each use 16 units, balancing gain with conserving 3 units. This supports both our current progress and future sustainability. Agree?\"",
    "timestamp": "2025-05-14T12:39:49.456422"
  },
  {
    "round": 4,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's each use 16 units, balancing our gains with conserving for future rounds, promoting sustainability and mutual benefit. Agree?\"",
    "timestamp": "2025-05-14T12:39:50.545015"
  },
  {
    "round": 4,
    "sender_id": "J1",
    "recipient_id": "C1",
    "message": "\"How about 16 units each? This allows us to conserve resources while ensuring mutual benefit and sustainable gains in the coming rounds.\"",
    "timestamp": "2025-05-14T12:39:52.153770"
  },
  {
    "round": 4,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's use 15 units each. This conserves resources, ensuring mutual gain and sustainability in future rounds. How does this strategy work for you?\"",
    "timestamp": "2025-05-14T12:39:53.247223"
  },
  {
    "round": 4,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Let's each use 16 units. Balances resource conservation with mutual benefits, ensuring sustainable gains for both now and in future rounds. Agree?\"",
    "timestamp": "2025-05-14T12:39:54.324926"
  },
  {
    "round": 5,
    "sender_id": "C1",
    "recipient_id": "J1",
    "message": "\"Let's aim for 15 units each—preserves resources and ensures we both gain sustainably. Does this align with your goals?\"",
    "timestamp": "2025-05-14T12:40:05.288695"
  },
  {
    "round": 5,
    "sender_id": "C1",
    "recipient_id": "D1",
    "message": "\"Let's optimize by using 14 each. Ensures personal gain while preserving resources for future rounds. Does this strategy align with your goals?\"",
    "timestamp": "2025-05-14T12:40:06.412194"
  },
  {
    "round": 5,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's use 14 units each—balances current gain and future sustainability. Does this strategy align with your objectives?\"",
    "timestamp": "2025-05-14T12:40:07.398993"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "U1",
    "message": "\"Let's use 15 each to balance gains and conserve resources for future rounds. This ensures both our progress and sustainability. Thoughts?\"",
    "timestamp": "2025-05-14T12:40:08.970415"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Let's each use 14 units to balance personal gain and resource conservation for future rounds. Ensures growth and sustainability. Thoughts?\"",
    "timestamp": "2025-05-14T12:40:10.351978"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "\"Let's use 15 units each, balancing immediate gain with conserving resources for future strategy. Supports both our progress and sustainability. Thoughts?\"",
    "timestamp": "2025-05-14T12:40:11.579191"
  },
  {
    "round": 5,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "\"Let's aim for 13 each, ensuring a fair balance between current points and future sustainability. How does this approach fit with your goals?\"",
    "timestamp": "2025-05-14T12:40:18.007418"
  },
  {
    "round": 5,
    "sender_id": "V1",
    "recipient_id": "D1",
    "message": "\"Let's each use 12 units. Balances current gain and ensures some pool growth for future rounds. Does this align with your objectives?\"",
    "timestamp": "2025-05-14T12:40:19.773406"
  },
  {
    "round": 5,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "\"Let's each use 13 units. Balances personal gain and future pool growth. Does this strategy align with your sustainability goals?\"",
    "timestamp": "2025-05-14T12:40:21.690833"
  },
  {
    "round": 5,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each use 14 units. This balances current needs and sustainability, ensuring future resources for both. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:40:23.567391"
  },
  {
    "round": 5,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "\"Let's use 14 units each to ensure current gains while conserving resources for future rounds. Does this plan align with your approach?\"",
    "timestamp": "2025-05-14T12:40:24.892889"
  },
  {
    "round": 5,
    "sender_id": "U1",
    "recipient_id": "C1",
    "message": "\"Let's use 14 units each. This strategy balances immediate benefits with conserving resources, ensuring sustainable goals for us both. Your thoughts?\"",
    "timestamp": "2025-05-14T12:40:26.015556"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"How about using 15 each to balance our gains while preserving 0 for future sustainability? Strikes a balance between growth now and later.\"",
    "timestamp": "2025-05-14T12:40:34.517172"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Let's each use 13 units for fair growth while leaving a bit for future sustainability. Balances both immediate and long-term gains. Thoughts?\"",
    "timestamp": "2025-05-14T12:40:35.757717"
  },
  {
    "round": 5,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "\"Let's target 14 units each for balanced gains and future sustainability. Ensures mutual benefit now and later. Thoughts?\"",
    "timestamp": "2025-05-14T12:40:37.694816"
  },
  {
    "round": 5,
    "sender_id": "E1",
    "recipient_id": "U1",
    "message": "\"Shall we use 16 units each? It balances immediate gain and future sustainability, supporting our long-term goals and ethical resource use.\"",
    "timestamp": "2025-05-14T12:40:39.360997"
  },
  {
    "round": 5,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"Let's use 16 units each for mutual benefit and sustainable growth. This ensures balance between immediate gain and long-term resource health.\"",
    "timestamp": "2025-05-14T12:40:40.468567"
  },
  {
    "round": 5,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Let's use 16 units each. It offers balanced gain and ensures resources grow sustainably, supporting both our long-term objectives.\"",
    "timestamp": "2025-05-14T12:40:41.945405"
  },
  {
    "round": 5,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's use 15 units each to balance between immediate gains and conserving resources for future rounds. Ensures sustainable success for both.\"",
    "timestamp": "2025-05-14T12:40:45.299410"
  },
  {
    "round": 5,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "“Let's settle on 15 units each for balanced gains and future resource conservation, ensuring ongoing success for both of us.”",
    "timestamp": "2025-05-14T12:40:46.701036"
  },
  {
    "round": 5,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Let's aim for 15 units each to secure immediate benefits while conserving resources for lasting success. Balance today for a better tomorrow.\"",
    "timestamp": "2025-05-14T12:40:48.162469"
  },
  {
    "round": 6,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's use 15 units each. This ensures resource conservation while benefiting both of us in the long run. Agree?\"",
    "timestamp": "2025-05-14T12:40:51.246593"
  },
  {
    "round": 6,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's use 14 units each. This balances current points and resource conservation, supporting both our goals for sustainable success.\"",
    "timestamp": "2025-05-14T12:40:52.175835"
  },
  {
    "round": 6,
    "sender_id": "C1",
    "recipient_id": "D1",
    "message": "\"Let's aim for 15 units each to ensure balanced growth and sustainable success in upcoming rounds. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:40:53.565107"
  },
  {
    "round": 6,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Let's use 15 units each. This balances personal gain and ensures resource availability for future rounds, benefiting both our strategies.\"",
    "timestamp": "2025-05-14T12:41:03.097117"
  },
  {
    "round": 6,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's aim for 14 units each. This balances our current needs with sustainability, ensuring resources for future rounds and mutual growth.\"",
    "timestamp": "2025-05-14T12:41:04.335331"
  },
  {
    "round": 6,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "\"Let's use 14 units each. This balances our needs and ensures resources for future rounds, supporting both of our goals.\"",
    "timestamp": "2025-05-14T12:41:05.645071"
  },
  {
    "round": 6,
    "sender_id": "E1",
    "recipient_id": "U1",
    "message": "\"Let's each use 14 units. This maintains a balance between resource conservation and our individual gains, ensuring sustainability for future rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:08.514830"
  },
  {
    "round": 6,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Let's use 14 units each. This balances our gains and conserves resources for future rounds, supporting both our strategies. Agree?\"",
    "timestamp": "2025-05-14T12:41:10.058992"
  },
  {
    "round": 6,
    "sender_id": "E1",
    "recipient_id": "C1",
    "message": "\"Let's each use 14 units to balance resource conservation with our benefits, ensuring sustainable gains for both of us. How does that sound?\"",
    "timestamp": "2025-05-14T12:41:11.171632"
  },
  {
    "round": 6,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Let's use 15 units each for balanced progress and sustainability. This ensures both our success now and in future rounds. Agree?\"",
    "timestamp": "2025-05-14T12:41:13.020956"
  },
  {
    "round": 6,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each use 14 units to balance current gains and future resource sustainability, ensuring both our success long-term.\"",
    "timestamp": "2025-05-14T12:41:14.204372"
  },
  {
    "round": 6,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "\"Let's use 14 units each. This balances immediate benefits with resource conservation, ensuring our mutual success now and for future rounds. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:15.273996"
  },
  {
    "round": 6,
    "sender_id": "D1",
    "recipient_id": "U1",
    "message": "\"Let's use 14 units each. This balances our current gains with resource conservation for future rounds. Does this align with your strategy?\"",
    "timestamp": "2025-05-14T12:41:16.911895"
  },
  {
    "round": 6,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "\"Let's aim for 13 units each, balancing current gain with future resource sustainability. Does this align with your strategy for mutual success?\"",
    "timestamp": "2025-05-14T12:41:18.019307"
  },
  {
    "round": 6,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "\"Let's aim for 14 units each, balancing immediate gain with resource sustainability, ensuring future benefits for both of us. Does this align with your goals?\"",
    "timestamp": "2025-05-14T12:41:19.363589"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "D1",
    "message": "\"Let's aim for 12 units each, balancing our goals with sustainability. This ensures progress while preserving future opportunities. Thoughts on this approach?\"",
    "timestamp": "2025-05-14T12:41:29.190539"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "E1",
    "message": "\"How about using 13 units each? This balances immediate benefit with resource conservation, ensuring mutual progress and sustainability. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:30.435067"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"How about using 12 units each? Balances personal gain with resource conservation, ensuring sustainable progress for both. How do you feel about this plan?\"",
    "timestamp": "2025-05-14T12:41:31.604534"
  },
  {
    "round": 7,
    "sender_id": "J1",
    "recipient_id": "U1",
    "message": "\"Let's use 15 units each. Balances immediate need with future rounds' sustainability. Ensures mutual success now and later. Do you agree?\"",
    "timestamp": "2025-05-14T12:41:35.448087"
  },
  {
    "round": 7,
    "sender_id": "J1",
    "recipient_id": "D1",
    "message": "\"Let's aim for 14 units each, balancing current needs with sustainability. Ensures mutual gain now and supports long-term success. Do you agree?\"",
    "timestamp": "2025-05-14T12:41:36.564916"
  },
  {
    "round": 7,
    "sender_id": "J1",
    "recipient_id": "E1",
    "message": "\"Let's target 15 units each for immediate gain and resource balance. Supports mutual benefits now and in future rounds. Agree?\"",
    "timestamp": "2025-05-14T12:41:37.720658"
  },
  {
    "round": 7,
    "sender_id": "E1",
    "recipient_id": "D1",
    "message": "\"Let's use 13 units each. It balances immediate gains with resource conservation, supporting both our long-term interests.\"",
    "timestamp": "2025-05-14T12:41:39.743411"
  },
  {
    "round": 7,
    "sender_id": "E1",
    "recipient_id": "V1",
    "message": "\"Let's aim for 14 units each. This balances our immediate gains with future resource availability, aligning with both our long-term strategies.\"",
    "timestamp": "2025-05-14T12:41:41.401448"
  },
  {
    "round": 7,
    "sender_id": "E1",
    "recipient_id": "U1",
    "message": "\"Let's aim for 14 units each. This ensures mutual benefits now while preserving resources, aligning with our long-term success strategies.\"",
    "timestamp": "2025-05-14T12:41:42.717870"
  },
  {
    "round": 7,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Let's both use 13 units. It balances gain and conservation, aligning with shared sustainability and individual success.\"",
    "timestamp": "2025-05-14T12:41:44.276410"
  },
  {
    "round": 7,
    "sender_id": "V1",
    "recipient_id": "J1",
    "message": "\"Let's use 12 units each, balancing our gain and conserving resources for future rounds, ensuring both our success.\"",
    "timestamp": "2025-05-14T12:41:45.569576"
  },
  {
    "round": 7,
    "sender_id": "V1",
    "recipient_id": "C1",
    "message": "\"Let's use 13 units each, balancing personal gain with resource sustainability for mutual long-term success.\"",
    "timestamp": "2025-05-14T12:41:46.709321"
  },
  {
    "round": 7,
    "sender_id": "D1",
    "recipient_id": "J1",
    "message": "\"Let's aim for 13 units each. It balances our needs today and ensures we both benefit in the future. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:50.401026"
  },
  {
    "round": 7,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Let's aim for 13 units each. Balances current benefits with future resource sustainability, ensuring mutual progress. Your thoughts?\"",
    "timestamp": "2025-05-14T12:41:51.641591"
  },
  {
    "round": 7,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Let's aim for 12 units each, balancing immediate needs with long-term sustainability. This ensures stable gains and future success. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:52.745555"
  },
  {
    "round": 7,
    "sender_id": "U1",
    "recipient_id": "D1",
    "message": "\"Let's each use 10 units. This conserves resources for future rounds while ensuring we both benefit now. Does this fit your strategy?\"",
    "timestamp": "2025-05-14T12:41:57.659439"
  },
  {
    "round": 7,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Let's use 9 units each. This balances immediate gains with resource preservation, ensuring future rounds benefit both of us. Thoughts?\"",
    "timestamp": "2025-05-14T12:41:58.820406"
  },
  {
    "round": 7,
    "sender_id": "U1",
    "recipient_id": "V1",
    "message": "\"Let's each take 8 units. This optimizes our current benefits while conserving resources for future rounds, aligning with both our goals. Agree?\"",
    "timestamp": "2025-05-14T12:42:00.272012"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's use 13 units each. It balances short-term gain with resource sustainability, aligning our strategies for mutual long-term success. Thoughts?\"",
    "timestamp": "2025-05-14T12:42:07.084629"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "J1",
    "message": "\"Let's aim for 13 units each, blending our gains with sustainable resource management to maximize both current points and future potentials. Agreed?\"",
    "timestamp": "2025-05-14T12:42:08.728020"
  },
  {
    "round": 7,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's use 13 units each, balancing our immediate gains with sustainable resources for long-term benefits. Does this align with your goals?\"",
    "timestamp": "2025-05-14T12:42:09.764045"
  },
  {
    "round": 8,
    "sender_id": "D1",
    "recipient_id": "C1",
    "message": "\"Let's each use 10 units. This balances our immediate needs with preserving resources, ensuring we both benefit now and for the next round.\"",
    "timestamp": "2025-05-14T12:42:14.509818"
  },
  {
    "round": 8,
    "sender_id": "D1",
    "recipient_id": "E1",
    "message": "\"Let's each take 11 units. It supports both our immediate goals and conserves resources for long-term mutual benefits.\"",
    "timestamp": "2025-05-14T12:42:16.156054"
  },
  {
    "round": 8,
    "sender_id": "D1",
    "recipient_id": "V1",
    "message": "\"Let's aim for 11 units each. It balances our current needs with conservation, ensuring we both thrive in the last rounds.\"",
    "timestamp": "2025-05-14T12:42:18.039562"
  },
  {
    "round": 8,
    "sender_id": "U1",
    "recipient_id": "J1",
    "message": "\"Propose we each use 13 units. Balances our needs and conserves resources for the final round, supporting mutual long-term success. Thoughts?\"",
    "timestamp": "2025-05-14T12:42:22.615929"
  },
  {
    "round": 8,
    "sender_id": "U1",
    "recipient_id": "C1",
    "message": "\"Propose we use 13 units each. Balances personal gain with conserving resources for the final round. Aligns our success strategies. Thoughts?\"",
    "timestamp": "2025-05-14T12:42:24.287100"
  },
  {
    "round": 8,
    "sender_id": "U1",
    "recipient_id": "E1",
    "message": "\"Let's each use 13 units. Balances mutual benefits and resource conservation, ensuring effective strategies for this round and the final one.\"",
    "timestamp": "2025-05-14T12:42:26.007942"
  },
  {
    "round": 8,
    "sender_id": "E1",
    "recipient_id": "J1",
    "message": "\"How about each taking 12 units? It balances immediate benefits with resource conservation, helping us both as we near the end game.\"",
    "timestamp": "2025-05-14T12:42:27.565049"
  },
  {
    "round": 8,
    "sender_id": "E1",
    "recipient_id": "C1",
    "message": "\"Let's each take 11 units. Balances our gains and ensures enough resources for the final round. Aiming for mutual success and sustainability.\"",
    "timestamp": "2025-05-14T12:42:28.986753"
  },
  {
    "round": 8,
    "sender_id": "E1",
    "recipient_id": "U1",
    "message": "\"Let's each use 12 units. This balances immediate gain and resource conservation, aiming for mutual success and sustainability as we approach the final round.\"",
    "timestamp": "2025-05-14T12:42:30.162089"
  },
  {
    "round": 8,
    "sender_id": "V1",
    "recipient_id": "U1",
    "message": "\"Let's take 9 units each. It optimizes our gains now and keeps resources available for the final round. What do you think?\"",
    "timestamp": "2025-05-14T12:42:31.564347"
  },
  {
    "round": 8,
    "sender_id": "V1",
    "recipient_id": "D1",
    "message": "\"Let's each take 8 units to ensure good gains now and preserve resources for the final round. Your thoughts?\"",
    "timestamp": "2025-05-14T12:42:32.993619"
  },
  {
    "round": 8,
    "sender_id": "V1",
    "recipient_id": "E1",
    "message": "\"Let's each take 8 units. It balances immediate gains and preserves enough for the final round. Thoughts on this strategy?\"",
    "timestamp": "2025-05-14T12:42:34.422681"
  },
  {
    "round": 8,
    "sender_id": "C1",
    "recipient_id": "U1",
    "message": "\"Let's use 10 each. Balances current and future gains, ensuring we both succeed sustainably now and in the final round.\"",
    "timestamp": "2025-05-14T12:42:38.004494"
  },
  {
    "round": 8,
    "sender_id": "C1",
    "recipient_id": "V1",
    "message": "\"Let's each use 10. This balances our current needs and ensures we have enough resources to thrive in the final round.\"",
    "timestamp": "2025-05-14T12:42:38.918940"
  },
  {
    "round": 8,
    "sender_id": "C1",
    "recipient_id": "J1",
    "message": "\"Let's use 10 units each for balanced gains now and in the final round, ensuring mutual success and sustainability.\"",
    "timestamp": "2025-05-14T12:42:40.066365"
  }
]